---
type: AreaBasedLoadType
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 6
tags: [revit-api, class]
---

# AreaBasedLoadType

`Autodesk.Revit.DB.Electrical.AreaBasedLoadType` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2023 | `public static AreaBasedLoadType Create ( Document document , string name )` |
| Property | ApparentPowerDensity | 2023 | `public double ApparentPowerDensity { get ; set ; }` |
| Property | LoadClassification | 2023 | `public ElementId LoadClassification { get ; set ; }` |
| Property | LoadDensity | 2023 | `public double LoadDensity { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | PowerFactor | 2023 | `public double PowerFactor { get ; set ; }` |